In [1]:
from pyspark.sql import SparkSession

spark = SparkSession.builder \
    .appName("HR_SparkSQL_Notebook") \
    .getOrCreate()

25/12/27 15:23:26 WARN Utils: Your hostname, spark resolves to a loopback address: 127.0.1.1; using 10.0.2.15 instead (on interface enp0s3)
25/12/27 15:23:26 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/12/27 15:23:27 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
25/12/27 15:23:27 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.

In [2]:
employees_df = spark.read.csv("employees.csv", header=True, inferSchema=True)
departments_df = spark.read.csv("departments.csv", header=True, inferSchema=True)
dept_emp_df = spark.read.csv("dept_emp.csv", header=True, inferSchema=True)
dept_manager_df = spark.read.csv("dept_manager.csv", header=True, inferSchema=True)
salaries_df = spark.read.csv("salaries.csv", header=True, inferSchema=True)
titles_df = spark.read.csv("titles.csv", header=True, inferSchema=True)

In [3]:
employees_df.createOrReplaceTempView("employees")
departments_df.createOrReplaceTempView("departments")
dept_emp_df.createOrReplaceTempView("dept_emp")
dept_manager_df.createOrReplaceTempView("dept_manager")
salaries_df.createOrReplaceTempView("salaries")
titles_df.createOrReplaceTempView("titles")

In [4]:
print("""
List each department’s name, the total number of employees in that department,
and the average salary of its employees.
Only include departments that have more than 5 employees,
and sort the results by average salary in descending order.
""")

query1 = spark.sql("""
SELECT d.dept_name,
       COUNT(de.emp_no) AS employee_count,
       ROUND(AVG(s.salary), 2) AS avg_salary
FROM dept_emp de
JOIN departments d ON de.dept_no = d.dept_no
JOIN salaries s ON de.emp_no = s.emp_no
GROUP BY d.dept_name
HAVING COUNT(de.emp_no) > 5
ORDER BY avg_salary DESC
""")

query1.show()

List each department’s name, the total number of employees in that department,
and the average salary of its employees.
Only include departments that have more than 5 employees,
and sort the results by average salary in descending order.

+------------------+--------------+----------+
|         dept_name|employee_count|avg_salary|
+------------------+--------------+----------+
|             Sales|         13496|  80777.18|
|         Marketing|          4877|  71851.46|
|           Finance|          4596|  70763.31|
|          Research|          5282|  60507.64|
|       Development|         22396|  59946.67|
|        Production|         20069|  59857.59|
|  Customer Service|          6236|  58878.95|
|Quality Management|          5094|  58300.46|
|   Human Resources|          4573|  55961.88|
+------------------+--------------+----------+

In [5]:
print("""
Retrieve the top 20 highest-paid employees.
The result should include each employee’s employee number, first name, last name,
department name, job title, and salary.
Sort the results by salary in descending order.
""")

query2 = spark.sql("""
SELECT e.emp_no,
       e.first_name,
       e.last_name,
       d.dept_name,
       t.title,
       s.salary
FROM employees e
JOIN dept_emp de ON e.emp_no = de.emp_no
JOIN departments d ON de.dept_no = d.dept_no
JOIN titles t ON e.emp_no = t.emp_no
JOIN salaries s ON e.emp_no = s.emp_no
ORDER BY s.salary DESC
LIMIT 20
""")

query2.show()

Retrieve the top 20 highest-paid employees.
The result should include each employee’s employee number, first name, last name,
department name, job title, and salary.
Sort the results by salary in descending order.

+------+----------+---------+----------------+----------------+------+
|emp_no|first_name|last_name|       dept_name|           title|salary|
+------+----------+---------+----------------+----------------+------+
| 11486|   Itzchak|  Ramaiah|           Sales|           Staff|145732|
| 11486|   Itzchak|  Ramaiah|           Sales|    Senior Staff|145732|
| 18006|     Vidya| Hanabata|Customer Service|           Staff|144866|
| 18006|     Vidya| Hanabata|Customer Service|    Senior Staff|144866|
| 18006|     Vidya| Hanabata|           Sales|           Staff|144866|
| 18006|     Vidya| Hanabata|           Sales|    Senior Staff|144866|
| 14487|  Jungsoon|Molenkamp|           Sales|           Staff|144534|
| 14487|  Jungsoon|Molenkamp|           Sales|    Senior Staff|144534|
| 13386|   Khosrow|   Sgarro|     Development|Technique Leader|144434|
| 18006|     Vidya| Hanabata|Customer Service|    Senior Staff|142384|
| 18006|     Vidya| Hanabata|Customer Service|           Staff|142384|
| 18006|     Vidya| Hanabata|           Sales|    Senior Staff|142384|
| 18006|     Vidya| Hanabata|           Sales|           Staff|142384|
| 11486|   Itzchak|  Ramaiah|           Sales|    Senior Staff|142176|
| 11486|   Itzchak|  Ramaiah|           Sales|           Staff|142176|
| 18006|     Vidya| Hanabata|           Sales|    Senior Staff|141369|
| 18006|     Vidya| Hanabata|Customer Service|           Staff|141369|
| 18006|     Vidya| Hanabata|Customer Service|    Senior Staff|141369|
| 18006|     Vidya| Hanabata|           Sales|           Staff|141369|
| 12149|  Suebskul|Grandbois|           Sales|    Senior Staff|141114|
+------+----------+---------+----------------+----------------+------+

In [6]:
print("""
Find the average salary for each job title.
Display the job title and the average salary.
Sort the results by average salary in descending order.
""")

query3 = spark.sql("""
SELECT t.title,
       ROUND(AVG(s.salary), 2) AS avg_salary
FROM titles t
JOIN salaries s ON t.emp_no = s.emp_no
GROUP BY t.title
ORDER BY avg_salary DESC
""")

query3.show()

Find the average salary for each job title.
Display the job title and the average salary.
Sort the results by average salary in descending order.

+------------------+----------+
|             title|avg_salary|
+------------------+----------+
|      Senior Staff|  70774.71|
|             Staff|  69652.95|
|   Senior Engineer|  61141.05|
|          Engineer|  59995.52|
|  Technique Leader|  59690.93|
|Assistant Engineer|  59651.75|
+------------------+----------+

In [7]:
print("""
Find the average salary for each job title.
Display the job title and the average salary.
Sort the results by average salary in descending order.
""")

query3 = spark.sql("""
SELECT t.title,
       ROUND(AVG(s.salary), 2) AS avg_salary
FROM titles t
JOIN salaries s ON t.emp_no = s.emp_no
GROUP BY t.title
ORDER BY avg_salary DESC
""")

query3.show()

Find the average salary for each job title.
Display the job title and the average salary.
Sort the results by average salary in descending order.

+------------------+----------+
|             title|avg_salary|
+------------------+----------+
|      Senior Staff|  70774.71|
|             Staff|  69652.95|
|   Senior Engineer|  61141.05|
|          Engineer|  59995.52|
|  Technique Leader|  59690.93|
|Assistant Engineer|  59651.75|
+------------------+----------+